package by.it.senchenko.jd01_12;


public class Text {
    static String test = "Абелиолистник  " +
            "Абелиолистник двурядный  " +
            "Абелия  " +
            "Абелия корейская  " +
            "Абрикос  " +
            "Абрикос  " +
            "Абрикос  " +
            "Абутилон  " +
            "Абутилон гибридный  " +
            "Аверроа карамбола  " +
            "Авокадо приятнейшее  " +
            "Авран  " +
            "Авран  " +
            "Авран лекарственный  " +
            "Агава  " +
            "Агава американская  " +
            "Агава королевы Виктории  " +
            "Агапантус  " +
            "Агапантус зонтичный  " +
            "Агератина высочайшая  " +
            "Агератум  " +
            "Агератум Хоустона  " +
            "Агератум мексиканский  " +
            "Аглаонема  " +
            "Аглаонема изменчивая  " +
            "Адамово дерево  " +
            "Адениум  " +
            "Адениум толстый  " +
            "Адениум тучный  " +
            "Адиантум  ";
}
